# TooFarAway Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
BuiltInFailures..::..SiteImportFailures..::..TooFarAway Property
BuiltInFailures..::..SiteImportFailures Class See Also
---
Imported Toposurface Points are located a large distance from the model and might not display properly. Points will be centered on the model instead.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TooFarAway { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TooFarAway As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TooFarAway {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteImportFailures Class
Autodesk.Revit.DB Namespace